{"_id":{"$oid":"6195f457d967121d4295aeaf"},"Title":"Spider-man Far From Home","Description":"Peter Parker's relaxing European vacation takes an unexpected turn when Nick Fury shows up in his hotel room to recruit him for a mission.","Director":{"Name":"Jon Watts","Bio":"This is an update test","Birth":"1981-06-28"},"ImagePath": "https://www.imdb.com/title/tt6751668/mediaviewer/rm3194916865/",
	"Featured": true}
{"_id":{"$oid":"619694e5d967121d4295aeb0"},"Title":"Beautiful Noise","Description":"Beautiful Noise is a 2014 American music documentary film, written and directed by Eric Green. The film documents three rock bands—Cocteau Twins, The Jesus and Mary Chain, and My Bloody Valentine—and their influence on shoegazing and other alternative rock genres. Beautiful Noise features extracts from over 50 interviews with bands and artists, as well as archival footage and music videos.","Director":{"Name":"Eric Green","Bio":"Eric Green Writer, Director, Producer is an author of short stories, poems, screenplays, and articles.","Birth":"1962-05-06"},"Featured":false,"ImagePath":"BeautifulNoise.png"}
{"_id":{"$oid":"61969d41d967121d4295aeb1"},"Title":"The Decline of Western Civilization","Description":"Must See Movie!","Genre":{"Name":"Documentary","Description":"A documentary film or documentary is a non-fictional motion-picture intended to document reality, primarily for the purposes of instruction, education, or maintaining a historical record."},"Director":{"Name":"Penelope Spheeris","Bio":"Penelope Spheeris is an American film director, producer, and screenwriter. She has directed both documentary and scripted films. Her best-known works include the trilogy titled The Decline of Western Civilization, each covering an aspect of Los Angeles underground culture, and Wayne's World, her highest-grossing film.","Birth":"1946-12-02"},"ImagePath":"TheDecline.png","Featured":false}
{"_id":{"$oid":"6196a1e2d967121d4295aeb2"},"Title":"Clerks","Description":"Dante (Brian O'Halloran) is called in to cover a shift at his New Jersey convenience store on his day off. His friend Randal (Jeff Anderson) helps him pass the time, neglecting his video-store customers next door to hang out in the Quick Stop. The uneventful day is disrupted by news that one of Dante's ex-girlfriends has died. After attending her memorial service, Dante muses over staying with current girlfriend Veronica (Marilyn Ghigliotti) or reuniting with ex Caitlin (Lisa Spoonhauer).","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Kevin Smith","Bio":"Kevin Smith is an American filmmaker, actor, comedian, comic book writer, author, and podcaster. He came to prominence with the low-budget comedy film Clerks (1994), which he wrote, directed, co-produced, and acted in as the character Silent Bob of stoner duo Jay and Silent Bob.","Birth":"1970-08-02"},"ImagePath":"https://www.imdb.com/title/tt0109445/mediaviewer/rm672010240/","Featured":true}
{"_id":{"$oid":"6196a309d967121d4295aeb3"},"Title":"Private Parts","Description":" The life and career of shock-jock superstar Howard Stern (himself) is recounted from his humble beginnings to his view from the top. Possessing a desire to be an on-air personality since childhood, Stern meanders through the radio world, always with his supportive wife, Alison (Mary McCormack), by his side. Landing a gig in Washington, D.C., Stern meets Robin Quivers (herself), who will become his long-time partner in crime. When the two move to New York, they face the wrath of NBC executives.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Betty Thomas","Bio":"Betty Thomas is an American actress, director, and producer of television and motion pictures. She is known for her Emmy Award-winning role as Sergeant Lucy Bates on the television series Hill Street Blues.","Birth":"1947-07-27"},"ImagePath":"PrivateParts.png","Featured":false}
{"_id":{"$oid":"6196a4f8d967121d4295aeb4"},"Title":"Zootopia","Description":"From the largest elephant to the smallest shrew, the city of Zootopia is a mammal metropolis where various animals live and thrive. When Judy Hopps (Ginnifer Goodwin) becomes the first rabbit to join the police force, she quickly learns how tough it is to enforce the law. Determined to prove herself, Judy jumps at the opportunity to solve a mysterious case. Unfortunately, that means working with Nick Wilde (Jason Bateman), a wily fox who makes her job even harder.","Genre":{"Name":"Animated","Description":"Animation is a method in which pictures are manipulated to appear as moving images. In traditional animation, images are drawn or painted by hand on transparent celluloid sheets to be photographed and exhibited on film."},"Director":{"Name":"Rich Moore","Bio":"Rich Moore is an American film and television animation director, screenwriter and voice actor. In addition to directing the films Wreck-It Ralph (2012) and co-directing Zootopia (2016) and Ralph Breaks the Internet (2018) for Walt Disney Animation Studios, he has worked on the animated television series The Simpsons, The Critic and Futurama. He is a two-time Emmy Award winner, a three-time Annie Award winner and an Academy Award winner. ","Birth":"1963-05-10"},"ImagePath":"Zootopia.png","Featured":true}
{"_id":{"$oid":"6196a8ddd967121d4295aeb5"},"Title":"Dogtown and Z-Boys","Description":"Dogtown and Z-Boys directed and co-written by skateboard legend-turned-filmmaker Stacy Peralta, is the story of a group of accidental revolutionaries, gifted kids who inadvertently changed the world by doing what came naturally. It is also a unique documentary event: a ground-level, eyewitness account of the birth of an organic American pop culture phenomenon.","Genre":{"Name":"Documentary","Description":"A documentary film or documentary is a non-fictional motion-picture intended to document reality, primarily for the purposes of instruction, education, or maintaining a historical record"},"Director":{"Name":"Stacy Peralta","Bio":"Stacy Peralta is an American film director and entrepreneur. He was previously a professional skateboarder and surfer with the Zephyr Competition Team, also known as the Z-Boys, from Venice, California. ","Birth":"1957-10-15"},"ImagePath":"Dogtown.png","Featured":false}
{"_id":{"$oid":"6196a9bcd967121d4295aeb6"},"Title":"Deadpool","Description":"Wade Wilson (Ryan Reynolds) is a former Special Forces operative who now works as a mercenary. His world comes crashing down when evil scientist Ajax (Ed Skrein) tortures, disfigures and transforms him into Deadpool. The rogue experiment leaves Deadpool with accelerated healing powers and a twisted sense of humor. With help from mutant allies Colossus and Negasonic Teenage Warhead (Brianna Hildebrand), Deadpool uses his new skills to hunt down the man who nearly destroyed his life.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Tim Miller ","Bio":"is an American film director, producer, screenwriter, and visual effects artist. He made his feature-film directing debut with Deadpool (2016). He was nominated for the Academy Award for Best Animated Short Film as co-story writer and executive producer of the short animated film Gopher Broke (2004). Miller directed Terminator: Dark Fate (2019), and also designed the title sequences of The Girl with the Dragon Tattoo and Thor: The Dark World.","Birth":"1964-10-10"},"ImagePath":"Deadpool.png","Featured":true}
{"_id":{"$oid":"6196aaf3d967121d4295aeb7"},"Title":"Beyond The Mat","Description":"Barry Blaustein's honest, intimate, revealing, highly entertaining, and critically acclaimed behind-the-scenes look at wrestling, takes viewers beyond the ring and into the lives of the men and women who inhabit this colorful, competitive, and surprisingly complex world.","Genre":{"Name":"Documentary","Description":"A documentary film or documentary is a non-fictional motion-picture intended to document reality, primarily for the purposes of instruction, education, or maintaining a historical record"},"Director":{"Name":"Barry W. Blaustein","Bio":"Barry W. Blaustein is an American comedy writer best known for his writing on Saturday Night Live and What's Alan Watching? and the screenplays for Coming to America, Coming 2 America and The Nutty Professor all written in collaboration with David Sheffield.","Birth":"1948-03-23"},"ImagePath":"Beyond.png","Featured":true}
{"_id":{"$oid":"6196acc3d967121d4295aeb8"},"Title":"Spider-Man: Homecoming","Description":"Thrilled by his experience with the Avengers, young Peter Parker returns home to live with his Aunt May. Under the watchful eye of mentor Tony Stark, Parker starts to embrace his newfound identity as Spider-Man. He also tries to return to his normal daily routine -- distracted by thoughts of proving himself to be more than just a friendly neighborhood superhero. Peter must soon put his powers to the test when the evil Vulture emerges to threaten everything that he holds dear.","Genre":{"Name":"Action/Adventure","Description":"This style of film is split into two styles, with one involving faraway, exotic lands where the villains and the action become unpredictable."},"Director":{"Name":"Jon Watts","Bio":"This is an update test","Birth":"1981-06-28"},"ImagePath":"Homecoming.png","Featured":true}
